import React, { StrictMode } from "react";
import ReactDOM from "react-dom/client";
import "./index.css";
import App from "./App";

const root = ReactDOM.createRoot(document.getElementById("root"));
root.render(
  <StrictMode>
    <App />
  </StrictMode>
);

// StrictMode - це спеціальний компонент, який надає React, і він використовується для
// поліпшення виявлення потенційних проблем у вашому додатку та розробці на ранніх стадіях.
// Використовуючи < StrictMode >, ви можете здійснювати перевірку та ідентифікацію певних
// проблем в вашому додатку, що може допомогти вам покращити його якість.

// Основні функції StrictMode включають:

// Виявлення помилок: StrictMode допомагає виявити потенційні проблеми та помилки у вашому
// коді під час рендерингу компонентів.Він виводить повідомлення про помилки в консолі
// браузера, що допомагає розробнику знайти та виправити проблеми.

// Перевірка дотримання рекомендацій: StrictMode також перевіряє дотримання рекомендацій
// щодо використання React, таких як використання застарілих методів життєвого циклу
// або дублювання key у списку елементів.

// Перевірка викликів компонентів: StrictMode сповіщає про незакриті джерела, такі як
// підписки на ресурси, власні звільнення та інші ненадійні практики.

// Перевірка визначення контексту: Використовуючи StrictMode, ви можете переконатися,
// що визначення контексту відбувається в тій же компоненті, де і використовується,
// і це допомагає уникнути недоліків в передачі значень через контекст.

// Перевірка двократного виклику рендерингу: StrictMode сприяє виявленню проблем,
// пов'язаних з двократним рендерингом компонентів в рамках одного циклу оновлення.

// Призначення StrictMode - підвищити якість та надійність вашого React - додатку,
// зменшити ймовірність виникнення помилок і покращити розробку на ранніх стадіях.
// Цей компонент зазвичай використовується тільки під час розробки та налагодження і
// повинен бути вилучений перед випуском виробничої версії додатку.
